package com.chester.shen.bagua.entity;

/**
 * @author Chester Shen
 * @date 2023/02/06 14:15
 * 卦象代表的意思
 * 八卦：乾兑 离 震 巽 坎 艮 坤
 *
 * 四象：太阳 少阴 少阳 太阴
 * 南方为火，北方为水，东方为木，西方为金，中间为土
 * 南方朱雀，北方玄武，东方青龙，西方白虎
 *
 * 两仪：
 * 阳：乾、坎、艮、震、四卦，属阳卦，其中∶ 艮为少男 坎为中男 震为长男（震、坎、艮中阴多阳少，表示阴从阳，故为阳卦 ）
 * 阴：坤、兑、离、巽、四卦，属阴卦 其中：兑为少女 离为中女 巽为长女（兑、离、巽阳多阴少，表示阳从阴，故为阴卦 ）
 *
 * 后天八卦九宫：
 * 乾六、坎一、艮八
 * 兑七、宫五、震三
 * 坤二、离九、巽四
 *
 * 一数坎来二数坤，三震四巽是中分，五数中宫六乾是，七兑八艮九离门
 * 以上后天八卦九宫排列数，横竖相加、对角相加之和，均等于15。
 */
public class GuaXiang {
    //乾（☰）、坎（☵）、艮（☶）、震（☳）、巽（☴）、离（☲）、坤（☷）、兑（☱）
    private String name;
    //宇宙:乾为天，坤为地，震为雷，巽为风，坎为水，离为火，艮为山，兑为泽
    private String universe;
    //家庭:乾父也，坤母也，震长男，巽长女，坎中男，离中女，艮少男，兑少女
    private String family;
    //动物:乾为马，坤为牛，震为龙，巽为鸡，坎为豕，离为雉，艮为狗，兑为羊
    private String animal;
    //身体:乾为首，坤为腹，震为足，巽为股，坎为耳，离为目，艮为手，兑为口
    private String body;
    //运动:乾健也，坤顺也，震动也，巽入也，坎陷也，离丽也，艮止也，兑说也
    private String motion;
    //权力:乾为君，坤为众
    private String power;
    //金-乾、兑　乾为天，兑为泽
    //木-震、巽　震为雷，巽为风
    //土-坤、艮　坤为地，艮为山
    //水-坎　坎为水（月亮）
    //火-离　离为火（太阳）
    //五行相生：木生火，火生土，土生金，金生水，水生木
    //五行相克：金克木，木克土，土克水，水克火，火克金
    private String fiveElements;
    //先天八卦：乾一，兑二，离三，震四，巽五，坎六，艮七，坤八。
    //后天八卦：坎一、坤二、震三、巽四、五为中宫，乾六、兑七、艮八、离九。
    private String num;
    //乾、兑（金）生坎（水），坎（水）生震、巽（木），震、巽（木）生离（火），离（火）生坤、艮（土），坤、艮（土）生乾、兑（金）
    //乾、兑（金）克震、巽（木），震、巽（木）克坤、艮（土），坤、艮（土）克坎（水），坎（水）克离（火），离（火）克乾、兑（金）
    private String mutuallyCounteract;
    //乾、兑旺于秋，衰于冬；震、巽旺于春，衰于夏；
    //坤、艮旺于四季，衰于秋；离旺于夏，衰于四季；
    //坎旺于冬，衰于春．（四季是指每个季节的后一个月。）
    private String ProsperityAndDecline;
}
